Revit 2024 API
ElementParameterFilter Members
The ElementParameterFilter type exposes the following members.
Constructors
Name | Description
ElementParameterFilter(FilterRule)
 Constructs a new instance of an ElementParameterFilter from a single rule.
ElementParameterFilter(IList<FilterRule>)
 Constructs a new instance of an ElementParameterFilter from a set of rules.
ElementParameterFilter(FilterRule, Boolean)
 Constructs a new instance of an ElementParameterFilter, with the option to match all elements not passing a given filter rule.
ElementParameterFilter(IList<FilterRule>, Boolean)
 Constructs a new instance of an ElementParameterFilter, with the option to match all elements not passing the given filter rules.
Methods
Name | Description
Dispose |  (Inherited from ElementFilter.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetRules
 Returns the set of rules contained in this filter.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
PassesFilter(Element)
 Applies the filter to a given element.
 (Inherited from ElementFilter.)
PassesFilter(Document, ElementId)
 Applies the filter to a given element.
 (Inherited from ElementFilter.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Inverted
 True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.
 (Inherited from ElementFilter.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from ElementFilter.)
See Also
ElementParameterFilter Class
Autodesk.Revit.DB Namespace